namespace Bars.Gkh.FormatDataExport.Enums
{
    using System;

    /// <summary>
    /// Флаги поставщиков информации
    /// </summary>
    [Flags]
    public enum FormatDataExportProviderFlags : uint
    {
        /// <summary>
        /// Никто
        /// </summary>
        None = 0x00000000,

        /// <summary>
        /// Управляющая организация (1)
        /// </summary>
        Uo = 0x00000001,

        /// <summary>
        /// Ресурсоснабжающая организация (2)
        /// </summary>
        Rso = 0x00000002,

        /// <summary>
        /// Государственная жилищная инспекция (4)
        /// </summary>
        Gji = 0x00000008,

        /// <summary>
        /// Орган местного самоуправления, осуществляющий муниципальный жилищный контроль (5)
        /// </summary>
        Omjk = 0x00000010,

        /// <summary>
        /// Федеральный орган исполнительной власти в области государственного регулирования тарифов
        /// </summary>
        Fst = 0x00000020,

        /// <summary>
        /// Орган государственной власти субъекта РФ (7)
        /// </summary>
        Ogv = 0x00000040,

        /// <summary>
        /// Орган местного самоуправления (8)
        /// </summary>
        Oms = 0x00000080,

        /// <summary>
        /// Орган исполнительной власти субъекта РФ в области государственного регулирования тарифов
        /// </summary>
        Oiv = 0x00000100,

        /// <summary>
        /// Администратор общего собрания собственников помещений в многоквартирном доме
        /// </summary>
        AdminOss = 0x00000200,

        /// <summary>
        /// Орган государственной власти субъекта РФ в области энергосбережения и повышения энергетической эффективности (12)
        /// </summary>
        OgvEnergo = 0x00000400,

        /// <summary>
        /// Орган или организация, уполномоченная на осуществление государственного учета жилищного фонда
        /// </summary>
        GjiAccounting = 0x00000800,

        /// <summary>
        /// Региональный оператор капитального ремонта (14)
        /// </summary>
        RegOpCr = 0x00001000,

        /// <summary>
        /// Фонд содействия реформированию жилищно-коммунального хозяйства
        /// </summary>
        GkhFound = 0x00002000,

        /// <summary>
        /// Уполномоченный орган субъекта РФ
        /// </summary>
        Uos = 0x00004000,

        /// <summary>
        /// Министерство строительства и жилищно-коммунального хозяйства Российской Федерации
        /// </summary>
        MinStroy = 0x00008000,

        /// <summary>
        /// Региональный оператор по обращению с твердыми коммунальными отходами (18)
        /// </summary>
        RegOpWaste = 0x00010000,

        /// <summary>
        /// Расчетный центр (36)
        /// </summary>
        Rc = 0x00020000,

        /// <summary>
        /// Все
        /// </summary>
        All = 0xFFFFFFFF,
    }
}