namespace Bars.GkhGji.Regions.Smolensk.Enums
{
    using Bars.B4.Utils;

    public enum TypeVerificationSubject
    {
        [Display("соблюдение обязательных требований")]
        Type10 = 10,

        [Display("соответствие сведений, содержащихся в уведомлении о начале осуществления отдельных видов предпринимательской деятельности, обязательным требованиям")]
        Type20 = 20,

        [Display("выполнение предписаний органов государственного контроля (надзора)")]
        Type30 = 30,

        [Display("проведение мероприятий по предотвращению причинения вреда жизни, здоровью граждан, вреда животным, растениям, окружающей среде")]
        Type40 = 40,

        [Display("проведение мероприятий по предупреждению возникновения чрезвычайных ситуаций природного и техногенного характера")]
        Type50 = 50,

        [Display("проведение мероприятий по обеспечению безопасности государства")]
        Type60 = 60,

        [Display("проведение мероприятий по ликвидации последствий причинения такого вреда")]
        Type70 = 70
    }
}