namespace Bars.Gkh.Migrations._2023.Version_2023050119
{
    using System.Data;
    using Bars.B4.Modules.Ecm7.Framework;
    using Bars.B4.Modules.NH.Migrations.DatabaseExtensions;
    using Bars.Gkh.FormatDataExport.ExportableEntities;
    using Bars.Gkh.Utils;

    [Migration("2023050119")]

    [MigrationDependsOn(typeof(Version_2023050118.UpdateSchema))]

    /// Является Version_2019032500 из ядра
    public class UpdateSchema : Migration
    {
        public override void Up()
        {
            this.Database.AddEntityTable("TP_COMPARE_CODE",
                new Column("FORM_CODE", DbType.String, 50),
                new Column("CELL_CODE", DbType.String, 50),
                new Column("VALUE", DbType.String, 50),
                new Column("CODE_MJF", DbType.String, 50),
                new Column("CODE_RIS", DbType.String, 50),
                new Column("CODE_REFORMA", DbType.String, 50));

            this.Database.ExecuteNonQuery(
                @"insert into TP_COMPARE_CODE (object_version, object_create_date, object_edit_date, form_code, cell_code, value, code_mjf, code_ris, code_reforma) values
                    --Конструкция крыши
                    (0, now(), now(), 'Form_5_6', '1:3', '10', '10', '8', '1'), --Плоская
                    (0, now(), now(), 'Form_5_6', '1:3', '20', '20', '9', '2'), --Скатная
                    (0, now(), now(), 'Form_5_6', '1:3', '70', '70', '1', '1'), --Вальмовая сложной формы
                    (0, now(), now(), 'Form_5_6', '1:3', '60', '60', '2', '1'), --Полувальмовая
                    (0, now(), now(), 'Form_5_6', '1:3', '40', '40', '3', '2'), --Двускатная
                    (0, now(), now(), 'Form_5_6', '1:3', '30', '30', '4', '2'), --Односкатная
                    (0, now(), now(), 'Form_5_6', '1:3', '80', '80', '6', '1'), --Шатровая
                    (0, now(), now(), 'Form_5_6', '1:3', '50', '50', '7', '1'), --Вальмовая
                    
                    --Газоснабжение
                    (0, now(), now(), 'Form_3_4', '1:3', '3', '3', '4', '1'), --Отсутствует
                    (0, now(), now(), 'Form_3_4', '1:3', '1', '1', '1', '2'), --Центральное
                    (0, now(), now(), 'Form_3_4', '1:3', '2', '2', '4', '3'), --Нецентральное
                    (0, now(), now(), 'Form_3_4', '1:3', '4', '4', '2', '3'), --Баллонный газ
                    (0, now(), now(), 'Form_3_4', '1:3', '5', '5', '3', '3'), --От накопителей (дворовые)
                    (0, now(), now(), 'Form_3_4', '1:3', '6', '6', '6119', '3'), --Газопровод низкого давления – подача природного газа в крышную котельную
                    
                    --Горячее водоснабжение
                    (0, now(), now(), 'Form_3_2', '1:3', '6', '7', '7', '1'), --Отсутствует
                    (0, now(), now(), 'Form_3_2', '1:3', '1', '1', '7', '3'), --Центральное
                    (0, now(), now(), 'Form_3_2', '1:3', '2', '2', '1', '4'), --Автономная котельная (крышная, встроенно-пристроенная)
                    (0, now(), now(), 'Form_3_2', '1:3', '3', '3', '6', '5'), --Квартирное отопление (квартирный котел)
                    (0, now(), now(), 'Form_3_2', '1:3', '5', '5', '5', '6'), --Печное
                    (0, now(), now(), 'Form_3_2', '1:3', '7', '7', '6', '3'), --Индивидуальный котел
                    (0, now(), now(), 'Form_3_2', '1:3', '8', '8', '6120', '3'), --П-образная, с нижней разводкой магистралей
                    (0, now(), now(), 'Form_3_2', '1:3', '9', '9', '2', '3'), --Кольцевая или с закольцованными вводами
                    (0, now(), now(), 'Form_3_2', '1:3', '10', '10', '3', '3'), --Газовые колонки (ВДГО)
                    (0, now(), now(), 'Form_3_2', '1:3', '11', '11', '4', '3'), --Электроводонагреватели
                    (0, now(), now(), 'Form_3_2', '1:3', '12', '12', '5', '3'), --Дровяная колонка
                    (0, now(), now(), 'Form_3_2', '1:3', '13', '13', '1', '3'), --Тупиковая
                    (0, now(), now(), 'Form_3_2', '1:3', '14', '17', '6203', '3'), --Теплообменник
                    
                    --Холодное водоснабжение
                    (0, now(), now(), 'Form_3_2_CW', '1:3', '3', '3', '3', '1'), --Отсутствует
                    (0, now(), now(), 'Form_3_2_CW', '1:3', '1', '1', '6114', '2'), --Центральное
                    (0, now(), now(), 'Form_3_2_CW', '1:3', '2', '2', '1', '3'), --Автономное
                    (0, now(), now(), 'Form_3_2_CW', '1:3', '4', '4', '2', '3'), --Кольцевая или с закольцованными вводами
                    (0, now(), now(), 'Form_3_2_CW', '1:3', '5', '5', '1', '3'), --Тупиковая

                    --Отопление
                    (0, now(), now(), 'Form_3_1', '1:3', '', '0', '6', '1'), --Не задано
                    (0, now(), now(), 'Form_3_1', '1:3', '10', '10', '5', '7'), --Индивидуальное
                    (0, now(), now(), 'Form_3_1', '1:3', '20', '20', '1', '2'), --Централизованное
                    (0, now(), now(), 'Form_3_1', '1:3', '30', '30', '2', '5'), --Печная
                    (0, now(), now(), 'Form_3_1', '1:3', '40', '40', '3', '6'), --Электрическая
                    (0, now(), now(), 'Form_3_1', '1:3', '50', '50', '4', '3'), --Домовая котельная
                    (0, now(), now(), 'Form_3_1', '1:3', '60', '60', '5', '4'), --Квартирное отопление (котел)
                    (0, now(), now(), 'Form_3_1', '1:3', '70', '70', '6118', '3'), --Независимая (через теплообменники), двухтрубная, вертикальная, с нижней разводкой магистралей
                    
                    --Водоотведение
                    (0, now(), now(), 'Form_3_3_Water', '1:3', '3', '3', '1', '1'), --Отсутствует
                    (0, now(), now(), 'Form_3_3_Water', '1:3', '1', '1', '4', '2'), --Центральное
                    (0, now(), now(), 'Form_3_3_Water', '1:3', '2', '2', '2', '3'), --Автономное
                    (0, now(), now(), 'Form_3_3_Water', '1:3', '4', '4', '2', '3'), --Локальная канализация (септик)
                    (0, now(), now(), 'Form_3_3_Water', '1:3', '5', '5', '3', '3'), --Выгребная яма

                    --Тип перекрытий
                    (0, now(), now(), 'Form_5_3', '1:3', '4', '1', '1', '1'), --Не задано
                    (0, now(), now(), 'Form_5_3', '1:3', '2', '9', '3', '4'), --Смешанные
                    (0, now(), now(), 'Form_5_3', '1:3', '3', '10', '6129', '3'), --Деревянные
                    (0, now(), now(), 'Form_5_3', '1:3', '1', '6109', '6109', '2'), --Железобетонные
                    (0, now(), now(), 'Form_5_3', '1:3', '5', '6140', '6140', '4'), --Каркасные из тонкостенных оцинкованных термопрофилей для сборных зданий с утеплителем и обшивкой с двух сторон цементно-стружечной плитой
                    (0, now(), now(), 'Form_5_3', '1:3', '6', '6129', '6129', '3'), --Деревянные отепленные
                    (0, now(), now(), 'Form_5_3', '1:3', '7', '6123', '6123', '4'), --Панельно-стоечная конструкция из сборно-разборных панелей
                    (0, now(), now(), 'Form_5_3', '1:3', '8', '6051', '6051', '2'), --Перекрытия из железобетонных плит
                    (0, now(), now(), 'Form_5_3', '1:3', '9', '6014', '6014', '2'), --Перекрытие монолитное железобетонное
                    (0, now(), now(), 'Form_5_3', '1:3', '10', '6013', '6013', '2'), --Монолитные железобетонные плиты
                    (0, now(), now(), 'Form_5_3', '1:3', '11', '6011', '6011', '2'), --Плоские железобетонные плиты
                    (0, now(), now(), 'Form_5_3', '1:3', '12', '6012', '6012', '2'), --Железобетонные сборные плиты
                    (0, now(), now(), 'Form_5_3', '1:3', '13', '6010', '6010', '2'), --Перекрытия железобетонные
                    (0, now(), now(), 'Form_5_3', '1:3', '14', '2', '2', '2'), --Перекрытие монолитное
                    (0, now(), now(), 'Form_5_3', '1:3', '15', '3', '3', '4'), --Перекрытия из сборных и монолитных сплошных плит
                    (0, now(), now(), 'Form_5_3', '1:3', '16', '4', '4', '2'), --Перекрытия из сборного железобетонного настила
                    (0, now(), now(), 'Form_5_3', '1:3', '17', '5', '5', '2'), --Перекрытия из двухскорлупных железобетонных прокатных панелей
                    (0, now(), now(), 'Form_5_3', '1:3', '18	', '6', '6', '4'), --Перекрытия из кирпичных сводов по стальным балкам
                    (0, now(), now(), 'Form_5_3', '1:3', '19', '7', '7', '3'), --Перекрытия деревянные оштукатуренные
                    (0, now(), now(), 'Form_5_3', '1:3', '20', '8', '8', '3'), --Перекрытия деревянные неоштукатуренные
                    (0, now(), now(), 'Form_5_3', '1:3', '21', '6144', '6144', '4'), --Арболитовые плиты
                    (0, now(), now(), 'Form_5_3', '1:3', '22', '6143', '6143', '4'), --Из плит OSB с утеплителем
                    (0, now(), now(), 'Form_5_3', '1:3', '23', '6210', '6210', '4'), --Многопустотные
                    (0, now(), now(), 'Form_5_3', '1:3', '24', '6208', '6208', '4') --Сборные");
        }

        public override void Down()
        {
            this.Database.RemoveTable("TP_COMPARE_CODE");
        }
    }
}