namespace GisGkhLibrary.Enums
{
    public enum OKEI
    {
        //единицы длины
        Миллиметр = 3,
        Сантиметр = 4,
        Дециметр = 5,
        Метр = 6,
        Километр = 8,
        Мегаметр = 9,
        Дюйм = 39,
        Фут = 41,
        Ярд = 43,
        МорскаяМиля = 47,
        //объем
        КубическийМиллиметр = 110,
        Миллилитр = 111,
        Литр = 112,
        КубическийМетр = 113,
        Децилитр = 118,
        Гектолитр = 122,
        Мегалитр = 126,
        КубическийДюйм = 131,
        КубическийФут = 132,
        КубическийЯрд = 133,
        МиллионКубическихМетров = 159,
        //Экономические единицы
        КубическийМетрВЧас = 598
    }
}
