
Функционал: тесткейсы для раздела "Мероприятия по устранению нарушений"
Справочники - ГЖИ - Мероприятия по устранению нарушений


Предыстория: 
Дано пользователь добавляет новое мероприятие по устранению нарушений
И пользователь у этого мероприятия по устранению нарушений заполняет поле Наименование "мероприятие по устранению нарушений тест"
И пользователь у этого мероприятия по устранению нарушений заполняет поле Код "тест"

Сценарий: успешное добавление мероприятия по устранению нарушений
Когда пользователь сохраняет это мероприятие по устранению нарушений
Тогда запись по этому мероприятию по устранению нарушений присутствует в справочнике мероприятий по устранению нарушений

Сценарий: успешное удаление записи из справочника мероприятий по устранению нарушений
Когда пользователь сохраняет это мероприятие по устранению нарушений
И пользователь удаляет это мероприятие по устранению нарушений
Тогда запись по этому мероприятию по устранению нарушений отсутствует в справочнике мероприятий по устранению нарушений

Сценарий: успешное добавление дубля мероприятия по устранению нарушений
Когда пользователь сохраняет это мероприятие по устранению нарушений
Допустим пользователь добавляет новое мероприятие по устранению нарушений
И пользователь у этого мероприятия по устранению нарушений заполняет поле Наименование "мероприятие по устранению нарушений тест"
И пользователь у этого мероприятия по устранению нарушений заполняет поле Код "тест"
Когда пользователь сохраняет это мероприятие по устранению нарушений
Тогда запись по этому мероприятию по устранению нарушений присутствует в справочнике мероприятий по устранению нарушений

