
Функция: Удаление распоряжения на оплату
Капитальный ремонт – Программы капитального ремонта – Объекты капитального ремонта

Сценарий: успешное добавление акта выполненных работ
Когда пользователь у объекта кр "п. Лесной, снт. СНТ Авиатор-2, д. 1" добавляет новый акт выполненных работ
И пользователь у этого акта выполненных работ заполняет поле Работа "Ремонт фасада"
И пользователь у этого акта выполненных работ заполняет поле от "21.05.2015"
И пользователь у этого акта выполненных работ заполняет поле Объем "1"
И пользователь у этого акта выполненных работ заполняет поле Сумма "13"
И пользователь сохраняет этот акт выполненных работ
Тогда запись по этому акту выполненных работ присутствует в списке актов у этого объекта


