
Функция: Формирование Реестра неплательщиков
Региональный фонд - Абоненты - Реестр неплательщиков

Сценарий: успешное формирование реестра неплательщиков
Когда пользователь очищает реестр неплательщиков
И пользователь формирует реестр неплательщиков
Тогда в задачах присутствует запись
И у этой записи заполнено поле ID
И у этой записи заполнено поле Дата запуска "текущая дата"
И у этой записи заполнено поле Наименование "Формирование неплательщиков"
И у этой записи заполнено поле Статус "Успешно выполнена"
И у этой записи заполнено поле Процент выполнения "100"
И у этой записи заполнено поле Ход выполнения "Завершено"
И у этой записи заполнено поле Затраченное время
И в реестре неплательщиков обновились записи по неплательщикам