
Функционал: тесткейсы граничных значений для справочника "Муниципальные образования"
Справочники - Общие - Муниципальные образования 


Сценарий: неудачное добавление муниципального образования при незаполненных обязательных полях
Дано пользователь добавляет новое муниципальное образование
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию не сохраняется и падает ошибка с текстом "Не заполнены обязательные поля: Наименование"

Сценарий: удачное добавление муниципального образования при вводе граничных условий в 300 знаков, Наименование
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование 300 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию присутствует в справочнике муниципальных образований

Сценарий: неудачное добавление муниципального образования при вводе граничных условий в 301 знаков, Наименование
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование 301 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию не сохраняется и падает ошибка с текстом "Не заполнены обязательные поля: Наименование"

Сценарий: удачное добавление муниципального образования при вводе граничных условий в 30 знаков, Группа
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле Группа 30 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию присутствует в справочнике муниципальных образований

Сценарий: неудачное добавление муниципального образования при вводе граничных условий в 31 знаков, Группа
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле Группа 31 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию не сохраняется и падает ошибка с текстом "Не заполнены обязательные поля: Группа"

Сценарий: удачное добавление муниципального образования при вводе граничных условий в 10 знаков, Сокращение
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле Сокращение 10 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию присутствует в справочнике муниципальных образований

Сценарий: неудачное добавление муниципального образования при вводе граничных условий в 11 знаков, Сокращение
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле Сокращение 11 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию не сохраняется и падает ошибка с текстом "Не заполнены обязательные поля: Сокращение"

Сценарий: удачное добавление муниципального образования при вводе граничных условий в 30 знаков, Код
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле Код 30 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию присутствует в справочнике муниципальных образований

Сценарий: неудачное добавление муниципального образования при вводе граничных условий в 31 знаков, Код
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле Код 31 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию не сохраняется и падает ошибка с текстом "Не заполнены обязательные поля: Код"

Сценарий: удачное добавление муниципального образования при вводе граничных условий в 30 знаков, Федеральный номер
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле Федеральный номер 30 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию присутствует в справочнике муниципальных образований

Сценарий: неудачное добавление муниципального образования при вводе граничных условий в 31 знаков, Федеральный номер
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле Федеральный номер 31 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию не сохраняется и падает ошибка с текстом "Не заполнены обязательные поля: Федеральный номер"

Сценарий: удачное добавление муниципального образования при вводе граничных условий в 30 знаков, ОКАТО
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле ОКАТО 30 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию присутствует в справочнике муниципальных образований

Сценарий: неудачное добавление муниципального образования при вводе граничных условий в 31 знаков, ОКАТО
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле ОКАТО 31 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию не сохраняется и падает ошибка с текстом "Не заполнены обязательные поля: ОКАТО"

Сценарий: удачное добавление муниципального образования при вводе граничных условий в 30 знаков, OKTMO
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле OKTMO 30 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию присутствует в справочнике муниципальных образований

Сценарий: неудачное добавление муниципального образования при вводе граничных условий в 31 знаков, OKTMO
Дано пользователь добавляет новое муниципальное образование
И пользователь у этого муниципального образования заполняет поле Наименование "тест"
И пользователь у этого муниципального образования заполняет поле OKTMO 31 символов "1"
Когда пользователь сохраняет это муниципальное образование
Тогда запись по этому муниципальному образованию не сохраняется и падает ошибка с текстом "Не заполнены обязательные поля: OKTMO"

