
Функционал: тесткейсы для раздела "Формы собственности"
Справочники - Жилищно-коммунальное хозяйство - Формы собственности


Предыстория: 
Дано пользователь добавляет новую форму собственности
И пользователь у этой формы собственности заполняет поле Наименование "форма собственности тест"

Сценарий: успешное добавление материала стен
Когда пользователь сохраняет эту форму собственности
Тогда запись по этой форме собственности присутствует в справочнике форм собственности

Сценарий: успешное удаление записи из справочника форм собственности
Когда пользователь сохраняет эту форму собственности
И пользователь удаляет эту форму собственности
Тогда запись по этой форме собственности отсутствует в справочнике форм собственности