namespace Bars.GkhGji.Migrations._2017.Version_2017111400
{
    using System.Data;

    using Bars.B4.Modules.Ecm7.Framework;
    using Bars.B4.Modules.NH.Migrations.DatabaseExtensions;
    using Bars.Gkh.Utils;

    [Migration("2017111400")]
    [MigrationDependsOn(typeof(Version_2017111000.UpdateSchema))]
    public class UpdateSchema : Migration
    {
        private readonly string gjiDictCitizenship = "GJI_DICT_CITIZENSHIP";
        private readonly string gjiDictApplicantCategory = "GJI_DICT_APPLICANT_CATEGORY";
        private readonly string gjiDictQuestionKind = "GJI_DICT_QUESTION_KIND";
        private readonly string gjiDictQuestionType = "GJI_DICT_QUESTION_TYPE";
        private readonly string gjiAppealCitizensFiles = "GJI_APPEAL_CITIZENS_FILES";
        private readonly string gjiAppealDeclarantCategory = "GJI_APPEAL_DECLARANT_CATEGORY";
        private readonly string gjiAppealCitizenQuestions = "GJI_APPEAL_CITIZEN_QUESTIONS";
        private readonly string gjiAppealCitizenInspectors = "GJI_APPEAL_CITIZEN_INSPECTORS";

        public override void Up()
        {
            this.DropExists();

            this.Database.AddEntityTable(this.gjiDictCitizenship,
                new Column("name", DbType.String.WithSize(200), ColumnProperty.NotNull | ColumnProperty.Unique),
                new Column("full_name", DbType.String.WithSize(500)),
                new Column("oksm_2", DbType.String.WithSize(2), ColumnProperty.NotNull | ColumnProperty.Unique),
                new Column("oksm_3", DbType.String.WithSize(3), ColumnProperty.NotNull | ColumnProperty.Unique),
                new Column("oksm_code", DbType.Int32, ColumnProperty.NotNull | ColumnProperty.Unique));

            this.Database.AddEntityTable(this.gjiDictApplicantCategory,
                new Column("code", DbType.String.WithSize(3), ColumnProperty.NotNull | ColumnProperty.Unique),
                new Column("name", DbType.String.WithSize(100)));

            this.Database.AddEntityTable(this.gjiDictQuestionKind,
                new Column("code", DbType.String.WithSize(3)),
                new Column("name", DbType.String.WithSize(100)),
                new Column("type", DbType.Int32, ColumnProperty.Null));

            this.Database.AddEntityTable(this.gjiAppealCitizensFiles,
                new Column("name", DbType.String.WithSize(100), ColumnProperty.NotNull),
                new Column("description", DbType.String.WithSize(500)),
                new RefColumn("citizens_id", this.gjiAppealCitizensFiles + "_citizens", "gji_appeal_citizens", "id"),
                new FileColumn("file_id", this.gjiAppealCitizensFiles + "_file"));

            this.Database.AddEntityTable(this.gjiAppealDeclarantCategory,
                new RefColumn("citizens_id", this.gjiAppealDeclarantCategory + "_citizens", "gji_appeal_citizens", "id"),
                new RefColumn("category_id", this.gjiAppealDeclarantCategory + "_category", "gji_dict_applicant_category", "id"));

            this.Database.AddEntityTable(this.gjiAppealCitizenQuestions,
                new RefColumn("citizens_id", this.gjiAppealCitizenQuestions + "_citizens", "gji_appeal_citizens", "id"),
                new RefColumn("kind_id", this.gjiAppealCitizenQuestions + "_kind", "gji_dict_question_kind", "id"));

            this.FillData();
        }

        public override void Down()
        {
            this.DropExists();
        }

        private void DropExists()
        {
            this.Database.RemoveColumn("GJI_APPEAL_CITIZENS", "DECLARANT_PHONE");

            this.Database.RemoveTable(this.gjiAppealCitizenInspectors);
            this.Database.RemoveTable(this.gjiAppealCitizenQuestions);
            this.Database.RemoveTable(this.gjiAppealDeclarantCategory);
            this.Database.RemoveTable(this.gjiAppealCitizensFiles);
            this.Database.RemoveTable(this.gjiDictQuestionKind);
            this.Database.RemoveTable(this.gjiDictQuestionType);
            this.Database.RemoveTable(this.gjiDictApplicantCategory);
            this.Database.RemoveTable(this.gjiDictCitizenship);
        }

        private void FillData()
        {
            this.FillCitizenship();
            this.FillApplicantCategory();
            this.FillQuestionKind();
        }

        private void FillCitizenship()
        {
            this.Database.ExecuteNonQuery(
                $@"INSERT INTO {this.gjiDictCitizenship} 
                    (object_version, object_create_date, object_edit_date, name, full_name, oksm_2, oksm_3, oksm_code) VALUES 
                    (0, now(), now(), 'СЕНТ-ЛЮСИЯ', NULL, 'LC', 'LCA', 662),
                    (0, now(), now(), 'ГАЙАНА', 'Республика Гайана', 'GY', 'GUY', 328),
                    (0, now(), now(), 'БЕЛИЗ', NULL, 'BZ', 'BLZ', 84),
                    (0, now(), now(), 'СЛОВАКИЯ', 'Словацкая Республика', 'SK', 'SVK', 703),
                    (0, now(), now(), 'КИПР', 'Республика Кипр', 'CY', 'CYP', 196),
                    (0, now(), now(), 'ЭСТОНИЯ', 'Эстонская Республика', 'EE', 'EST', 233),
                    (0, now(), now(), 'РЕСПУБЛИКА МАКЕДОНИЯ', NULL, 'MK', 'MKD', 807),
                    (0, now(), now(), 'АНГОЛА', 'Республика Ангола', 'AO', 'AGO', 24),
                    (0, now(), now(), 'АЛБАНИЯ', 'Республика Албания', 'AL', 'ALB', 8),
                    (0, now(), now(), 'СУДАН', 'Республика Судан', 'SD', 'SDN', 736),
                    (0, now(), now(), 'МОЛДОВА, РЕСПУБЛИКА', 'Республика Молдова', 'MD', 'MDA', 498),
                    (0, now(), now(), 'ЛИБЕРИЯ', 'Республика Либерия', 'LR', 'LBR', 430),
                    (0, now(), now(), 'АЛЖИР', 'Алжирская Народная Демократическая Республика', 'DZ', 'DZA', 12),
                    (0, now(), now(), 'ЧАД', 'Республика Чад', 'TD', 'TCD', 148),
                    (0, now(), now(), 'НИГЕР', 'Республика Нигер', 'NE', 'NER', 562),
                    (0, now(), now(), 'ЛАОССКАЯ НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА', NULL, 'LA', 'LAO', 418),
                    (0, now(), now(), 'КАМБОДЖА', 'Королевство Камбоджа', 'KH', 'KHM', 116),
                    (0, now(), now(), 'ГАИТИ', 'Республика Гаити', 'HT', 'HTI', 332),
                    (0, now(), now(), 'ФИНЛЯНДИЯ', 'Финляндская Республика', 'FI', 'FIN', 246),
                    (0, now(), now(), 'МАКАО', 'Специальный административный регион Китая Макао', 'MO', 'MAC', 446),
                    (0, now(), now(), 'ДЖЕРСИ', NULL, 'JE', 'JEY', 832),
                    (0, now(), now(), 'ИРАК', 'Республика Ирак', 'IQ', 'IRQ', 368),
                    (0, now(), now(), 'СОЕДИНЕННОЕ КОРОЛЕВСТВО', 'Соединенное Королевство Великобритании и Северной Ирландии', 'GB', 'GBR', 826),
                    (0, now(), now(), 'ИНДИЯ', 'Республика Индия', 'IN', 'IND', 356),
                    (0, now(), now(), 'ЗАМБИЯ', 'Республика Замбия', 'ZM', 'ZMB', 894),
                    (0, now(), now(), 'СЛОВЕНИЯ', 'Республика Словения', 'SI', 'SVN', 705),
                    (0, now(), now(), 'МАЛЬДИВЫ', 'Мальдивская Республика', 'MV', 'MDV', 462),
                    (0, now(), now(), 'УКРАИНА', NULL, 'UA', 'UKR', 804),
                    (0, now(), now(), 'ДОМИНИКА', 'Содружество Доминики', 'DM', 'DMA', 212),
                    (0, now(), now(), 'БУТАН', 'Королевство Бутан', 'BT', 'BTN', 64),
                    (0, now(), now(), 'СЬЕРРА-ЛЕОНЕ', 'Республика Сьерра-Леоне', 'SL', 'SLE', 694),
                    (0, now(), now(), 'ЛЮКСЕМБУРГ', 'Великое Герцогство Люксембург', 'LU', 'LUX', 442),
                    (0, now(), now(), 'ДАНИЯ', 'Королевство Дания', 'DK', 'DNK', 208),
                    (0, now(), now(), 'ЗАПАДНАЯ САХАРА', NULL, 'EH', 'ESH', 732),
                    (0, now(), now(), 'ЭЛАНДСКИЕ ОСТРОВА', NULL, 'АХ', 'ALA', 248),
                    (0, now(), now(), 'ДОМИНИКАНСКАЯ РЕСПУБЛИКА', NULL, 'DO', 'DOM', 214),
                    (0, now(), now(), 'НИДЕРЛАНДСКИЕ АНТИЛЫ', NULL, 'AN', 'ANT', 530),
                    (0, now(), now(), 'ЛЕСОТО', 'Королевство Лесото', 'LS', 'LSO', 426),
                    (0, now(), now(), 'УЗБЕКИСТАН', 'Республика Узбекистан', 'UZ', 'UZB', 860),
                    (0, now(), now(), 'КАМЕРУН', 'Республика Камерун', 'CM', 'CMR', 120),
                    (0, now(), now(), 'ПЕРУ', 'Республика Перу', 'PE', 'PER', 604),
                    (0, now(), now(), 'ТАИЛАНД', 'Королевство Таиланд', 'TH', 'THA', 764),
                    (0, now(), now(), 'УРУГВАЙ', 'Восточная Республика Уругвай', 'UY', 'URY', 858),
                    (0, now(), now(), 'НИКАРАГУА', 'Республика Никарагуа', 'NI', 'NIC', 558),
                    (0, now(), now(), 'УГАНДА', 'Республика Уганда', 'UG', 'UGA', 800),
                    (0, now(), now(), 'ВЕНГРИЯ', 'Венгерская Республика', 'HU', 'HUN', 348),
                    (0, now(), now(), 'САМОА', 'Независимое Государство Самоа', 'WS', 'WSM', 882),
                    (0, now(), now(), 'ГЕРМАНИЯ', 'Федеративная Республика Германия', 'DE', 'DEU', 276),
                    (0, now(), now(), 'БЕНИН', 'Республика Бенин', 'BJ', 'BEN', 204),
                    (0, now(), now(), 'НАУРУ', 'Республика Науру', 'NR', 'NRU', 520),
                    (0, now(), now(), 'МАЛЫЕ ТИХООКЕАНСКИЕ ОТДАЛЕННЫЕ ОСТРОВА СОЕДИНЕННЫХ ШТАТОВ', NULL, 'UM', 'UMI', 581),
                    (0, now(), now(), 'НОРВЕГИЯ', 'Королевство Норвегия', 'NO', 'NOR', 578),
                    (0, now(), now(), 'КИРИБАТИ', 'Республика Кирибати', 'KI', 'KIR', 296),
                    (0, now(), now(), 'МЕКСИКА', 'Мексиканские Соединенные Штаты', 'MX', 'MEX', 484),
                    (0, now(), now(), 'ОСТРОВ НОРФОЛК', NULL, 'NF', 'NFK', 574),
                    (0, now(), now(), 'БАГАМЫ', 'Содружество Багамы', 'BS', 'BHS', 44),
                    (0, now(), now(), 'ТОКЕЛАУ', NULL, 'TK', 'TKL', 772),
                    (0, now(), now(), 'КОТ Д''ИВУАР', 'Республика Кот д''Ивуар', 'CI', 'CIV', 384),
                    (0, now(), now(), 'КАБО-ВЕРДЕ', 'Республика Кабо-Верде', 'CV', 'CPV', 132),
                    (0, now(), now(), 'ВЬЕТНАМ', 'Социалистическая Республика Вьетнам', 'VN', 'VNM', 704),
                    (0, now(), now(), 'АНТАРКТИДА', NULL, 'AQ', 'ATA', 10),
                    (0, now(), now(), 'БЕЛЬГИЯ', 'Королевство Бельгии', 'BE', 'BEL', 56),
                    (0, now(), now(), 'МЬЯНМА', 'Союз Мьянма', 'MM', 'MMR', 104),
                    (0, now(), now(), 'МАЛЬТА', 'Республика Мальта', 'MT', 'MLT', 470),
                    (0, now(), now(), 'ВЕНЕСУЭЛА БОЛИВАРИАНСКАЯ РЕСПУБЛИКА', 'Боливарианская Республика Венесуэла', 'VE', 'VEN', 862),
                    (0, now(), now(), 'ЧЕШСКАЯ РЕСПУБЛИКА', NULL, 'CZ', 'CZE', 203),
                    (0, now(), now(), 'АЗЕРБАЙДЖАН', 'Республика Азербайджан', 'AZ', 'AZE', 31),
                    (0, now(), now(), 'СЕРБИЯ', 'Республика Сербия', 'RS', 'SRB', 688),
                    (0, now(), now(), 'ЛИВАН', 'Ливанская Республика', 'LB', 'LBN', 422),
                    (0, now(), now(), 'ПАПСКИЙ ПРЕСТОЛ (ГОСУДАРСТВО - ГОРОД ВАТИКАН)', NULL, 'VA', 'VAT', 336),
                    (0, now(), now(), 'МАРТИНИКА', NULL, 'MQ', 'MTQ', 474),
                    (0, now(), now(), 'СИНГАПУР', 'Республика Сингапур', 'SG', 'SGP', 702),
                    (0, now(), now(), 'ОСТРОВ ХЕРД И ОСТРОВА МАКДОНАЛЬД', NULL, 'HM', 'HMD', 334),
                    (0, now(), now(), 'СВАЗИЛЕНД', 'Королевство Свазиленд', 'SZ', 'SWZ', 748),
                    (0, now(), now(), 'НОВАЯ КАЛЕДОНИЯ', NULL, 'NC', 'NCL', 540),
                    (0, now(), now(), 'МАЛИ', 'Республика Мали', 'ML', 'MLI', 466),
                    (0, now(), now(), 'КАТАР', 'Государство Катар', 'QA', 'QAT', 634),
                    (0, now(), now(), 'ИСЛАНДИЯ', 'Республика Исландия', 'IS', 'ISL', 352),
                    (0, now(), now(), 'ГВИНЕЯ', 'Гвинейская Республика', 'GN', 'GIN', 324),
                    (0, now(), now(), 'ФРАНЦУЗСКАЯ ПОЛИНЕЗИЯ', NULL, 'PF', 'PYF', 258),
                    (0, now(), now(), 'ГУАМ', NULL, 'GU', 'GUM', 316),
                    (0, now(), now(), 'МОЗАМБИК', 'Республика Мозамбик', 'MZ', 'MOZ', 508),
                    (0, now(), now(), 'ШВЕЦИЯ', 'Королевство Швеция', 'SE', 'SWE', 752),
                    (0, now(), now(), 'ПОЛЬША', 'Республика Польша', 'PL', 'POL', 616),
                    (0, now(), now(), 'СЕВЕРНЫЕ МАРИАНСКИЕ ОСТРОВА', 'Содружество Северных Марианских островов', 'MP', 'MNP', 580),
                    (0, now(), now(), 'ЭКВАДОР', 'Республика Эквадор', 'EC', 'ECU', 218),
                    (0, now(), now(), 'ИТАЛИЯ', 'Итальянская Республика', 'IT', 'ITA', 380),
                    (0, now(), now(), 'ЯПОНИЯ', NULL, 'JP', 'JPN', 392),
                    (0, now(), now(), 'ЭЛЬ-САЛЬВАДОР', 'Республика Эль-Сальвадор', 'SV', 'SLV', 222),
                    (0, now(), now(), 'ТУРКМЕНИЯ', 'Туркменистан', 'TM', 'TKM', 795),
                    (0, now(), now(), 'СЕН-МАРТЕН', NULL, 'MF', 'MAF', 663),
                    (0, now(), now(), 'КОРЕЯ, НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА', 'Корейская Народно-Демократическая Республика', 'KP', 'PRK', 408),
                    (0, now(), now(), 'ПОРТУГАЛИЯ', 'Португальская Республика', 'PT', 'PRT', 620),
                    (0, now(), now(), 'МАРОККО', 'Королевство Марокко', 'MA', 'MAR', 504),
                    (0, now(), now(), 'БРАЗИЛИЯ', 'Федеративная Республика Бразилия', 'BR', 'BRA', 76),
                    (0, now(), now(), 'НИДЕРЛАНДЫ', 'Королевство Нидерландов', 'NL', 'NLD', 528),
                    (0, now(), now(), 'БЕЛАРУСЬ', 'Республика Беларусь', 'BY', 'BLR', 112),
                    (0, now(), now(), 'ГРЕНЛАНДИЯ', NULL, 'GL', 'GRL', 304),
                    (0, now(), now(), 'ГИБРАЛТАР', NULL, 'GI', 'GIB', 292),
                    (0, now(), now(), 'ТУРЦИЯ', 'Турецкая Республика', 'TR', 'TUR', 792),
                    (0, now(), now(), 'ТАДЖИКИСТАН', 'Республика Таджикистан', 'TJ', 'TJK', 762),
                    (0, now(), now(), 'САН-ТОМЕ И ПРИНСИПИ', 'Демократическая Республика Сан-Томе и Принсипи', 'ST', 'STP', 678),
                    (0, now(), now(), 'ИНДОНЕЗИЯ', 'Республика Индонезия', 'ID', 'IDN', 360),
                    (0, now(), now(), 'ПАЛЕСТИНСКАЯ ТЕРРИТОРИЯ, ОККУПИРОВАННАЯ', 'Оккупированная Палестинская территория', 'PS', 'PSE', 275),
                    (0, now(), now(), 'ЧИЛИ', 'Республика Чили', 'CL', 'CHL', 152),
                    (0, now(), now(), 'МАВРИКИЙ', 'Республика Маврикий', 'MU', 'MUS', 480),
                    (0, now(), now(), 'КУВЕЙТ', 'Государство Кувейт', 'KW', 'KWT', 414),
                    (0, now(), now(), 'ПИТКЕРН', NULL, 'PN', 'PCN', 612),
                    (0, now(), now(), 'ТОНГА', 'Королевство Тонга', 'TO', 'TON', 776),
                    (0, now(), now(), 'ГОНДУРАС', 'Республика Гондурас', 'HN', 'HND', 340),
                    (0, now(), now(), 'ФРАНЦИЯ', 'Французская Республика', 'FR', 'FRA', 250),
                    (0, now(), now(), 'ПАКИСТАН', 'Исламская Республика Пакистан', 'PK', 'PAK', 586),
                    (0, now(), now(), 'ГРУЗИЯ', NULL, 'GE', 'GEO', 268),
                    (0, now(), now(), 'СЕНЕГАЛ', 'Республика Сенегал', 'SN', 'SEN', 686),
                    (0, now(), now(), 'КОРЕЯ, РЕСПУБЛИКА', 'Республика Корея', 'KR', 'KOR', 410),
                    (0, now(), now(), 'МОНТСЕРРАТ', NULL, 'MS', 'MSR', 500),
                    (0, now(), now(), 'МАЛАВИ', 'Республика Малави', 'MW', 'MWI', 454),
                    (0, now(), now(), 'ОСТРОВА КАЙМАН', NULL, 'KY', 'CYM', 136),
                    (0, now(), now(), 'ГОНКОНГ', 'Специальный административный регион Китая Гонконг', 'HK', 'HKG', 344),
                    (0, now(), now(), 'СОЛОМОНОВЫ ОСТРОВА', NULL, 'SB', 'SLB', 90),
                    (0, now(), now(), 'ТАЙВАНЬ (КИТАЙ)', NULL, 'TW', 'TWN', 158),
                    (0, now(), now(), 'ИЗРАИЛЬ', 'Государство Израиль', 'IL', 'ISR', 376),
                    (0, now(), now(), 'ЙЕМЕН', 'Йеменская Республика', 'YE', 'YEM', 887),
                    (0, now(), now(), 'ЛИТВА', 'Литовская Республика', 'LT', 'LTU', 440),
                    (0, now(), now(), 'ПУЭРТО-РИКО', NULL, 'PR', 'PRI', 630),
                    (0, now(), now(), 'ЮЖНАЯ ДЖОРДЖИЯ И ЮЖНЫЕ САНДВИЧЕВЫ ОСТРОВА', NULL, 'GS', 'SGS', 239),
                    (0, now(), now(), 'ЭРИТРЕЯ', NULL, 'ER', 'ERI', 232),
                    (0, now(), now(), 'КАНАДА', NULL, 'CA', 'CAN', 124),
                    (0, now(), now(), 'ТОГО', 'Тоголезская Республика', 'TG', 'TGO', 768),
                    (0, now(), now(), 'ЭФИОПИЯ', 'Федеративная Демократическая Республика Эфиопия', 'ET', 'ETH', 231),
                    (0, now(), now(), 'ФАРЕРСКИЕ ОСТРОВА', NULL, 'FO', 'FRO', 234),
                    (0, now(), now(), 'АРУБА', NULL, 'AW', 'ABW', 533),
                    (0, now(), now(), 'ЛИВИЙСКАЯ АРАБСКАЯ ДЖАМАХИРИЯ', 'Социалистическая Народная Ливийская Арабская Джамахирия', 'LY', 'LBY', 434),
                    (0, now(), now(), 'КОМОРЫ', 'Союз Коморы', 'KM', 'COM', 174),
                    (0, now(), now(), 'АНГИЛЬЯ', NULL, 'AI', 'AIA', 660),
                    (0, now(), now(), 'ГРЕНАДА', NULL, 'GD', 'GRD', 308),
                    (0, now(), now(), 'АВСТРАЛИЯ', NULL, 'AU', 'AUS', 36),
                    (0, now(), now(), 'ОМАН', 'Султанат Оман', 'OM', 'OMN', 512),
                    (0, now(), now(), 'НОВАЯ ЗЕЛАНДИЯ', NULL, 'NZ', 'NZL', 554),
                    (0, now(), now(), 'ГАНА', 'Республика Гана', 'GH', 'GHA', 288),
                    (0, now(), now(), 'ПАРАГВАЙ', 'Республика Парагвай', 'PY', 'PRY', 600),
                    (0, now(), now(), 'НЕПАЛ', 'Федеративная Демократическая Республика Непал', 'NP', 'NPL', 524),
                    (0, now(), now(), 'АМЕРИКАНСКОЕ САМОА', NULL, 'AS', 'ASM', 16),
                    (0, now(), now(), 'СЕНТ-КИТС И НЕВИС', NULL, 'KN', 'KNA', 659),
                    (0, now(), now(), 'ХОРВАТИЯ', 'Республика Хорватия', 'HR', 'HRV', 191),
                    (0, now(), now(), 'ЛИХТЕНШТЕЙН', 'Княжество Лихтенштейн', 'LI', 'LIE', 438),
                    (0, now(), now(), 'ГВАДЕЛУПА', NULL, 'GP', 'GLP', 312),
                    (0, now(), now(), 'ОСТРОВА ТЕРКС И КАЙКОС', NULL, 'TC', 'TCA', 796),
                    (0, now(), now(), 'ЮЖНАЯ АФРИКА', 'Южно-Африканская Республика', 'ZA', 'ZAF', 710),
                    (0, now(), now(), 'КОНГО, ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА', 'Демократическая Республика Конго', 'CD', 'COD', 180),
                    (0, now(), now(), 'БУРУНДИ', 'Республика Бурунди', 'BI', 'BDI', 108),
                    (0, now(), now(), 'ОСТРОВ БУВЕ', NULL, 'BV', 'BVT', 74),
                    (0, now(), now(), 'ФОЛКЛЕНДСКИЕ ОСТРОВА (МАЛЬВИНСКИЕ)', NULL, 'FK', 'FLK', 238),
                    (0, now(), now(), 'ТАНЗАНИЯ, ОБЪЕДИНЕННАЯ РЕСПУБЛИКА', 'Объединенная Республика Танзания', 'TZ', 'TZA', 834),
                    (0, now(), now(), 'МАВРИТАНИЯ', 'Исламская Республика Мавритания', 'MR', 'MRT', 478),
                    (0, now(), now(), 'КОСТА-РИКА', 'Республика Коста-Рика', 'CR', 'CRI', 188),
                    (0, now(), now(), 'БОЛИВИЯ, МНОГОНАЦИОНАЛЬНОЕ ГОСУДАРСТВО', 'Многонациональное Государство Боливия', 'BO', 'BOL', 68),
                    (0, now(), now(), 'АРГЕНТИНА', 'Аргентинская Республика', 'AR', 'ARG', 32),
                    (0, now(), now(), 'БАХРЕЙН', 'Королевство Бахрейн', 'BH', 'BHR', 48),
                    (0, now(), now(), 'ПАНАМА', 'Республика Панама', 'PA', 'PAN', 591),
                    (0, now(), now(), 'МАЙОТТА', NULL, 'YT', 'MYT', 175),
                    (0, now(), now(), 'ТРИНИДАД И ТОБАГО', 'Республика Тринидад и Тобаго', 'TT', 'TTO', 780),
                    (0, now(), now(), 'КИРГИЗИЯ', 'Киргизская Республика', 'KG', 'KGZ', 417),
                    (0, now(), now(), 'БРУНЕЙ-ДАРУССАЛАМ', NULL, 'BN', 'BRN', 96),
                    (0, now(), now(), 'МОНАКО', 'Княжество Монако', 'MC', 'MCO', 492),
                    (0, now(), now(), 'КОЛУМБИЯ', 'Республика Колумбия', 'CO', 'COL', 170),
                    (0, now(), now(), 'МАРШАЛЛОВЫ ОСТРОВА', 'Республика Маршалловы Острова', 'MH', 'MHL', 584),
                    (0, now(), now(), 'ОСТРОВ РОЖДЕСТВА', NULL, 'CX', 'CXR', 162),
                    (0, now(), now(), 'РУАНДА', 'Руандийская Республика', 'RW', 'RWA', 646),
                    (0, now(), now(), 'ШПИЦБЕРГЕН И ЯН МАЙЕН', NULL, 'SJ', 'SJM', 744),
                    (0, now(), now(), 'ЭКВАТОРИАЛЬНАЯ ГВИНЕЯ', 'Республика Экваториальная Гвинея', 'GQ', 'GNQ', 226),
                    (0, now(), now(), 'ЧЕРНОГОРИЯ', NULL, 'ME', 'MNE', 499),
                    (0, now(), now(), 'МАЛАЙЗИЯ', NULL, 'MY', 'MYS', 458),
                    (0, now(), now(), 'ФИДЖИ', 'Республика Островов Фиджи', 'FJ', 'FJI', 242),
                    (0, now(), now(), 'КОНГО', 'Республика Конго', 'CG', 'COG', 178),
                    (0, now(), now(), 'БАРБАДОС', NULL, 'BB', 'BRB', 52),
                    (0, now(), now(), 'ВИРГИНСКИЕ ОСТРОВА, США', 'Виргинские острова Соединенных Штатов', 'VI', 'VIR', 850),
                    (0, now(), now(), 'ЗИМБАБВЕ', 'Республика Зимбабве', 'ZW', 'ZWE', 716),
                    (0, now(), now(), 'ИРЛАНДИЯ', NULL, 'IE', 'IRL', 372),
                    (0, now(), now(), 'САУДОВСКАЯ АРАВИЯ', 'Королевство Саудовская Аравия', 'SA', 'SAU', 682),
                    (0, now(), now(), 'АНДОРРА', 'Княжество Андорра', 'AD', 'AND', 20),
                    (0, now(), now(), 'СУРИНАМ', 'Республика Суринам', 'SR', 'SUR', 740),
                    (0, now(), now(), 'БАНГЛАДЕШ', 'Народная Республика Бангладеш', 'BD', 'BGD', 50),
                    (0, now(), now(), 'КЕНИЯ', 'Республика Кения', 'KE', 'KEN', 404),
                    (0, now(), now(), 'ТИМОР-ЛЕСТЕ', 'Демократическая Республика Тимор-Лесте', 'TL', 'TLS', 626),
                    (0, now(), now(), 'НАМИБИЯ', 'Республика Намибия', 'NA', 'NAM', 516),
                    (0, now(), now(), 'ОСТРОВ МЭН', NULL, 'IM', 'IMN', 833),
                    (0, now(), now(), 'АВСТРИЯ', 'Австрийская Республика', 'AT', 'AUT', 40),
                    (0, now(), now(), 'ГВИНЕЯ-БИСАУ', 'Республика Гвинея-Бисау', 'GW', 'GNB', 624),
                    (0, now(), now(), 'ФРАНЦУЗСКИЕ ЮЖНЫЕ ТЕРРИТОРИИ', NULL, 'TF', 'ATF', 260),
                    (0, now(), now(), 'КАЗАХСТАН', 'Республика Казахстан', 'KZ', 'KAZ', 398),
                    (0, now(), now(), 'СОМАЛИ', 'Сомалийская Республика', 'SO', 'SOM', 706),
                    (0, now(), now(), 'САН-МАРИНО', 'Республика Сан-Марино', 'SM', 'SMR', 674),
                    (0, now(), now(), 'УОЛЛИС И ФУТУНА', NULL, 'WF', 'WLF', 876),
                    (0, now(), now(), 'СЕЙШЕЛЫ', 'Республика Сейшелы', 'SC', 'SYC', 690),
                    (0, now(), now(), 'СЕН-ПЬЕР И МИКЕЛОН', NULL, 'PM', 'SPM', 666),
                    (0, now(), now(), 'СЕН-БАРТЕЛЕМИ', NULL, 'BL', 'BLM', 652),
                    (0, now(), now(), 'СВЯТАЯ ЕЛЕНА', NULL, 'SH', 'SHN', 654),
                    (0, now(), now(), 'ГРЕЦИЯ', 'Греческая Республика', 'GR', 'GRC', 300),
                    (0, now(), now(), 'ШВЕЙЦАРИЯ', 'Швейцарская Конфедерация', 'CH', 'CHE', 756),
                    (0, now(), now(), 'АРМЕНИЯ', 'Республика Армения', 'AM', 'ARM', 51),
                    (0, now(), now(), 'МОНГОЛИЯ', NULL, 'MN', 'MNG', 496),
                    (0, now(), now(), 'ИОРДАНИЯ', 'Иорданское Хашимитское Королевство', 'JO', 'JOR', 400),
                    (0, now(), now(), 'АБХАЗИЯ', 'Республика Абхазия', 'AB', 'ABH', 895),
                    (0, now(), now(), 'НИГЕРИЯ', 'Федеративная Республика Нигерия', 'NG', 'NGA', 566),
                    (0, now(), now(), 'СЕНТ-ВИНСЕНТ И ГРЕНАДИНЫ', NULL, 'VC', 'VCT', 670),
                    (0, now(), now(), 'ЕГИПЕТ', 'Арабская Республика Египет', 'EG', 'EGY', 818),
                    (0, now(), now(), 'ГАБОН', 'Габонская Республика', 'GA', 'GAB', 266),
                    (0, now(), now(), 'ВИРГИНСКИЕ ОСТРОВА, БРИТАНСКИЕ', 'Британские Виргинские острова', 'VG', 'VGB', 92),
                    (0, now(), now(), 'МИКРОНЕЗИЯ, ФЕДЕРАТИВНЫЕ ШТАТЫ', 'Федеративные штаты Микронезии', 'FM', 'FSM', 583),
                    (0, now(), now(), 'БОЛГАРИЯ', 'Республика Болгария', 'BG', 'BGR', 100),
                    (0, now(), now(), 'ГЕРНСИ', NULL, 'GG', 'GGY', 831),
                    (0, now(), now(), 'ГВАТЕМАЛА', 'Республика Гватемала', 'GT', 'GTM', 320),
                    (0, now(), now(), 'ТУНИС', 'Тунисская Республика', 'TN', 'TUN', 788),
                    (0, now(), now(), 'ИРАН, ИСЛАМСКАЯ РЕСПУБЛИКА', 'Исламская Республика Иран', 'IR', 'IRN', 364),
                    (0, now(), now(), 'АНТИГУА И БАРБУДА', NULL, 'AG', 'ATG', 28),
                    (0, now(), now(), 'ЮЖНАЯ ОСЕТИЯ', 'Республика Южная Осетия', 'OS', 'OST', 896),
                    (0, now(), now(), 'ИСПАНИЯ', 'Королевство Испания', 'ES', 'ESP', 724),
                    (0, now(), now(), 'БУРКИНА-ФАСО', NULL, 'BF', 'BFA', 854),
                    (0, now(), now(), 'ДЖИБУТИ', 'Республика Джибути', 'DJ', 'DJI', 262),
                    (0, now(), now(), 'ЛАТВИЯ', 'Латвийская Республика', 'LV', 'LVA', 428),
                    (0, now(), now(), 'ТУВАЛУ', NULL, 'TV', 'TUV', 798),
                    (0, now(), now(), 'ЦЕНТРАЛЬНО-АФРИКАНСКАЯ РЕСПУБЛИКА', NULL, 'CF', 'CAF', 140),
                    (0, now(), now(), 'ВАНУАТУ', 'Республика Вануату', 'VU', 'VUT', 548),
                    (0, now(), now(), 'ОСТРОВА КУКА', NULL, 'CK', 'COK', 184),
                    (0, now(), now(), 'БРИТАНСКАЯ ТЕРРИТОРИЯ В ИНДИЙСКОМ ОКЕАНЕ', NULL, 'IO', 'IOT', 86),
                    (0, now(), now(), 'ПАЛАУ', 'Республика Палау', 'PW', 'PLW', 585),
                    (0, now(), now(), 'БОТСВАНА', 'Республика Ботсвана', 'BW', 'BWA', 72),
                    (0, now(), now(), 'ПАПУА-НОВАЯ ГВИНЕЯ', NULL, 'PG', 'PNG', 598),
                    (0, now(), now(), 'РОССИЯ', 'Российская Федерация', 'RU', 'RUS', 643),
                    (0, now(), now(), 'НИУЭ', 'Республика Ниуэ', 'NU', 'NIU', 570),
                    (0, now(), now(), 'СОЕДИНЕННЫЕ ШТАТЫ', 'Соединенные Штаты Америки', 'US', 'USA', 840),
                    (0, now(), now(), 'МАДАГАСКАР', 'Республика Мадагаскар', 'MG', 'MDG', 450),
                    (0, now(), now(), 'ФРАНЦУЗСКАЯ ГВИАНА', NULL, 'GF', 'GUF', 254),
                    (0, now(), now(), 'ШРИ-ЛАНКА', 'Демократическая Социалистическая Республика Шри-Ланка', 'LK', 'LKA', 144),
                    (0, now(), now(), 'СИРИЙСКАЯ АРАБСКАЯ РЕСПУБЛИКА', NULL, 'SY', 'SYR', 760),
                    (0, now(), now(), 'КОКОСОВЫЕ (КИЛИНГ) ОСТРОВА', NULL, 'CC', 'CCK', 166),
                    (0, now(), now(), 'КУБА', 'Республика Куба', 'CU', 'CUB', 192),
                    (0, now(), now(), 'КИТАЙ', 'Китайская Народная Республика', 'CN', 'CHN', 156),
                    (0, now(), now(), 'БЕРМУДЫ', NULL, 'BM', 'BMU', 60),
                    (0, now(), now(), 'АФГАНИСТАН', 'Переходное Исламское Государство Афганистан', 'AF', 'AFG', 4),
                    (0, now(), now(), 'РУМЫНИЯ', NULL, 'RO', 'ROU', 642),
                    (0, now(), now(), 'ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ', NULL, 'AE', 'ARE', 784),
                    (0, now(), now(), 'ФИЛИППИНЫ', 'Республика Филиппины', 'PH', 'PHL', 608),
                    (0, now(), now(), 'БОСНИЯ И ГЕРЦЕГОВИНА', NULL, 'BA', 'BIH', 70),
                    (0, now(), now(), 'РЕЮНЬОН', NULL, 'RE', 'REU', 638),
                    (0, now(), now(), 'ГАМБИЯ', 'Республика Гамбия', 'GM', 'GMB', 270),
                    (0, now(), now(), 'ЯМАЙКА', NULL, 'JM', 'JAM', 388);");
        }

        private void FillApplicantCategory()
        {
            this.Database.ExecuteNonQuery(
                $@"INSERT INTO {this.gjiDictApplicantCategory} 
                    (object_version, object_create_date, object_edit_date, code, name) VALUES
                    (0, now(), now(), '1', 'Государственный (муниципальный) служащий'),
                    (0, now(), now(), '2', 'Дети погибших участников ВОВ'),
                    (0, now(), now(), '3', 'Мать-одиночка'),
                    (0, now(), now(), '4', 'Отец-одиночка'),
                    (0, now(), now(), '5', 'Аграрий'),
                    (0, now(), now(), '6', 'Беженец, переселенец'),
                    (0, now(), now(), '7', 'Безработный'),
                    (0, now(), now(), '8', 'Без адреса, фамилии'),
                    (0, now(), now(), '9', 'БОМЖ'),
                    (0, now(), now(), '10', 'Военнослужащий'),
                    (0, now(), now(), '11', 'Ветеран боевых действий'),
                    (0, now(), now(), '12', 'Ветеран труда'),
                    (0, now(), now(), '13', 'Дети–сироты'),
                    (0, now(), now(), '14', 'Домохозяйка'),
                    (0, now(), now(), '15', 'Другие категории'),
                    (0, now(), now(), '16', 'Инвалид по общему заболеванию'),
                    (0, now(), now(), '17', 'Инвалид детства'),
                    (0, now(), now(), '18', 'Инвалид труда'),
                    (0, now(), now(), '19', 'Инвалид ВОВ'),
                    (0, now(), now(), '20', 'Инвалид ВС'),
                    (0, now(), now(), '21', 'Коллективное'),
                    (0, now(), now(), '22', 'Малоимущие'),
                    (0, now(), now(), '23', 'Многодетная семья'),
                    (0, now(), now(), '24', 'Неполная семья'),
                    (0, now(), now(), '25', 'Не установлена'),
                    (0, now(), now(), '26', 'Осужденный'),
                    (0, now(), now(), '27', 'Организация'),
                    (0, now(), now(), '28', 'Пенсионер'),
                    (0, now(), now(), '29', 'Пострадавший от радиации'),
                    (0, now(), now(), '30', 'Пострадавший от репрессии'),
                    (0, now(), now(), '31', 'Предприниматель'),
                    (0, now(), now(), '32', 'Психический больной'),
                    (0, now(), now(), '33', 'Рабочий'),
                    (0, now(), now(), '34', 'Работник здравоохранения'),
                    (0, now(), now(), '35', 'Работник культуры, спорта'),
                    (0, now(), now(), '36', 'Работник образования'),
                    (0, now(), now(), '37', 'Руководитель'),
                    (0, now(), now(), '38', 'Семья, имеющая детей инвалидов'),
                    (0, now(), now(), '39', 'Служащий'),
                    (0, now(), now(), '40', 'Труженик тыла'),
                    (0, now(), now(), '41', 'Участник ВОВ'),
                    (0, now(), now(), '42', 'Учащийся, студент')");
        }

        private void FillQuestionKind()
        {
            this.Database.ExecuteNonQuery(
                $@"INSERT INTO {this.gjiDictQuestionKind} 
                    (object_version, object_create_date, object_edit_date, code, name, type) VALUES
                    (0, now(), now(), '1', 'благодарность', 1),
                    (0, now(), now(), '2', 'жалоба гражданина на преследование за обращение', 2),
                    (0, now(), now(), '3', 'запрос информации', 3),
                    (0, now(), now(), '4', 'критика деятельности государственных органов', 3),
                    (0, now(), now(), '5', 'критика деятельности должностных лиц', 3),
                    (0, now(), now(), '6', 'критика деятельности органов местного самоуправления', 3),
                    (0, now(), now(), '7', 'материалы на ознакомление', 1),
                    (0, now(), now(), '8', 'оценка деятельности', 1),
                    (0, now(), now(), '9', 'поздравление', 1),
                    (0, now(), now(), '10', 'приглашение', 1),
                    (0, now(), now(), '11', 'просьба гражданина о восстановлении или защите его нарушенных законных интересов', 2),
                    (0, now(), now(), '12', 'просьба гражданина о восстановлении или защите его нарушенных прав', 2),
                    (0, now(), now(), '13', 'просьба гражданина о восстановлении или защите его нарушенных свобод', 2),
                    (0, now(), now(), '14', 'просьба гражданина о восстановлении или защите нарушенных законных интересов других лиц', 2),
                    (0, now(), now(), '15', 'просьба гражданина о восстановлении или защите нарушенных прав других лиц', 2),
                    (0, now(), now(), '16', 'просьба гражданина о восстановлении или защите нарушенных свобод других лиц', 2),
                    (0, now(), now(), '17', 'просьба гражданина о содействии в реализации  его конституционных прав', 3),
                    (0, now(), now(), '18', 'просьба гражданина о содействии в реализации его конституционных свобод', 3),
                    (0, now(), now(), '19', 'просьба гражданина о содействии в реализации конституционных прав других лиц', 3),
                    (0, now(), now(), '20', 'просьба гражданина о содействии в реализации конституционных свобод других лиц', 3),
                    (0, now(), now(), '21', 'просьба, не основанная на законе', 1),
                    (0, now(), now(), '22', 'рекомендации гражданина по развитию общественных отношений', 4),
                    (0, now(), now(), '23', 'рекомендации гражданина по совершенствованию деятельности государственных органов', 4),
                    (0, now(), now(), '24', 'рекомендации гражданина по совершенствованию деятельности органов местного самоуправления', 4),
                    (0, now(), now(), '25', 'рекомендации гражданина по совершенствованию законов', 4),
                    (0, now(), now(), '26', 'рекомендации гражданина по совершенствованию иных нормативных правовых актов', 4),
                    (0, now(), now(), '27', 'рекомендации гражданина по улучшению иных сфер деятельности государства', 4),
                    (0, now(), now(), '28', 'рекомендации гражданина по улучшению иных сфер деятельности общества', 4),
                    (0, now(), now(), '29', 'рекомендации гражданина по улучшению социально-экономической сферы деятельности государства', 4),
                    (0, now(), now(), '30', 'рекомендации гражданина по улучшению социально-экономической сферы общества', 4),
                    (0, now(), now(), '31', 'соболезнование', 1),
                    (0, now(), now(), '32', 'сообщение гражданина о нарушении законов', 3),
                    (0, now(), now(), '33', 'сообщение гражданина о нарушении иных нормативных правовых актов', 3),
                    (0, now(), now(), '34', 'сообщение гражданина о недостатках в работе государственных органов', 3),
                    (0, now(), now(), '35', 'сообщение гражданина о недостатках в работе должностных лиц', 3),
                    (0, now(), now(), '36', 'сообщение гражданина о недостатках в работе органов местного самоуправления', 3),
                    (0, now(), now(), '37', 'текст, не имеющий смысла', 1)");
        }
    }
}
