namespace Bars.GkhGji.Regions.Saha.Enums
{
    using Bars.B4.Utils;

    public enum TypeSurveySubject
    {
        [Display("соблюдение обязательных требований жилищного законодательства, "
                 + "законодательства об энергосбережении и повышении энергетической эффективности")]
        Type10 = 10,

        [Display("соблюдение обязательных требований жилищного законодательства к раскрытию информации в соответствии "
                 + "с утвержденным Правительством Российской Федерации стандартом раскрытия информации организациями, "
                 + "осуществляющими деятельность в сфере управления многоквартирными домами")]
        Type20 = 20,

        [Display("соблюдение обязательных требований жилищного законодательства, "
                 + "в том числе правил предоставления коммунальных услуг потребителям")]
        Type30 = 30,

        [Display("соблюдение обязательных требований жилищного законодательства, "
                 + "в том числе правил поставки коммунальных ресурсов потребителям")]
        Type40 = 40,

        [Display("соблюдение обязательных требований к содержанию общего имущества в многоквартирном доме")]
        Type50 = 50,

        [Display("соблюдение обязательных требований к выполнению лицами, осуществляющими управление многоквартирными "
                 + "домами услуг и работ по содержанию и ремонту общего имущества в многоквартирном доме в соответствии "
                 + "с требованиями законодательства Российской Федерации")]
        Type60 = 60,

        [Display("соблюдение обязательных требований к выполнению лицами, осуществляющими деятельность по выполнению "
                 + "услуг по содержанию и (или) работ по ремонту общего имущества в многоквартирном доме в соответствии "
                 + "с требованиями законодательства Российской Федерации")]
        Type70 = 70,

        [Display("соблюдение обязательных требований к жилым помещениям, их использованию и содержанию")]
        Type80 = 80,

        [Display("соблюдение обязательных требований к порядку перевода жилого помещения в нежилое "
                 + "помещение и нежилого помещения в жилое помещение")]
        Type90 = 90,

        [Display("соблюдение обязательных требований к порядку переустройства и перепланировки жилых помещений")]
        Type100 = 100,

        [Display("выполнение ранее выданного предписания")]
        Type110 = 110
    }
}