namespace Bars.Esia.OAuth20.App.Enums
{
    public enum AgencyType
    {
        /// <summary>
        /// Федеральный орган исполнительной власти
        /// </summary>
        Fed = 10,
        
        /// <summary>
        /// Орган исполнительной власти субъекта РФ
        /// </summary>
        Reg = 11,
        
        /// <summary>
        /// Орган местного самоуправления
        /// </summary>
        Lcl = 12,
        
        /// <summary>
        /// Подведомственная организация федерального органа исполнительной власти
        /// </summary>
        Pvd = 13,
        
        /// <summary>
        /// Государственное учреждение
        /// </summary>
        Gov = 20,
        
        /// <summary>
        /// Муниципальное учреждение
        /// </summary>
        Mcl = 21,
        
        /// <summary>
        /// Государственный внебюджетный фонд
        /// </summary>
        Fnd = 30,
        
        /// <summary>
        /// Подведомственная организация государственной внебюджетного фонда
        /// </summary>
        Pfn = 31,
        
        /// <summary>
        /// Многофункциональный центр
        /// </summary>
        Mfc = 40,
        
        /// <summary>
        /// Законодательный (представительный) орган государственной власти субъекта РФ
        /// </summary>
        Leg = 41
    }
}