namespace Bars.B4.Modules.FIAS
{
    using Bars.B4.Utils;

    /// <summary>
    /// Уровень объекта ФИАС
    /// </summary>
    public enum FiasLevelEnum : byte
    {
        /// <summary>
        /// Уровень региона
        /// </summary>
        [Display("Уровень региона")]
        Region = 1,

        /// <summary>
        /// Уровень автономного округа
        /// </summary>
        [Display("Уровень автономного округа")]
        AutonomusRegion = 2,

        /// <summary>
        /// Уровень района
        /// </summary>
        [Display("Уровень района")]
        Raion = 3,

        /// <summary>
        /// Уровень города
        /// </summary>
        [Display("Уровень города")]
        City = 4,

        /// <summary>
        /// Уровень внутригородской территории
        /// </summary>
        [Display("Уровень внутригородской территории")]
        Ctar = 5,

        /// <summary>
        /// Уровень населенного пункта
        /// </summary>
        [Display("Уровень населенного пункта")]
        Place = 6,

        /// <summary>
        /// Планировочная структура
        /// </summary>
        [Display("Планировочная структура")]
        PlanningStruct = 65,

        /// <summary>
        /// Уровень улицы
        /// </summary>
        [Display("Уровень улицы")]
        Street = 7,

        /// <summary>
        /// Земельный участок
        /// </summary>
        [Display("Земельный участок")]
        Stead = 75,

        /// <summary>
        /// Здания, сооружения, объекта незавершенного строительства
        /// </summary>
        [Display("Здания, сооружения, объекта незавершенного строительства")]
        Building = 8,

        /// <summary>
        /// Уровень помещения в пределах здания, сооружения
        /// </summary>
        [Display("Уровень помещения в пределах здания, сооружения")]
        Permises = 9,

        /// <summary>
        /// Уровень дополнительных территорий
        /// </summary>
        [Display("Уровень дополнительных территорий")]
        Extr = 90,

        /// <summary>
        /// Уровень подчиненных дополнительным территориям объектов
        /// </summary>
        [Display("Уровень подчиненных дополнительным территориям объектов")]
        Sext = 91
    }
}