Функция: Формирование Реестра неплательщиков
Региональный фонд - Абоненты - Реестр неплательщиков

Сценарий: успешное формирование реестра неплательщиков
Когда пользователь очищает реестр неплательщиков
И пользователь формирует реестр неплательщиков
То в реестре задач появилась задача с Наименованием "Формирование неплательщиков"
И в течении 60 мин статус задачи стал "Успешно выполнена"
И в течении 0 мин процент выполнения задачи стал "100"
И в течении 0 мин ход выполнения задачи стал "Завершено"
И в течении 0 мин в реестре неплательщиков обновились записи по неплательщикам