namespace Bars.GkhDi.Enums
{
    using Bars.B4.Utils;

    /// <summary>
    /// Перечисление для работы с путями полей раскрытия информации
    /// </summary>
    public enum DiFieldPathType
    {
        /// <summary>
        /// Жилищный фонд\Реестр жилых домов\Жилой дом\Протокол решений\Форма редактирования протокола решения
        /// </summary>
        [Display(@"Жилищный фонд\Реестр жилых домов\Жилой дом\Протокол решений\Форма редактирования протокола решения")]
        Path1 = 1,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Адрес
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Адрес")]
        Path2 = 2,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Документы
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Документы")]
        Path3 = 3,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Финансовые показатели\Коммунальные услуги
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Финансовые показатели\Коммунальные услуги")]
        Path4 = 4,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Финансовые показатели\Общие сведения
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Финансовые показатели\Общие сведения")]
        Path5 = 5,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Финансовые показатели\Претензии по качеству работ
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Финансовые показатели\Претензии по качеству работ")]
        Path6 = 6,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Финансовые показатели\Претензионно-исковая работа
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Объект в управлении\Финансовые показатели\Претензионно-исковая работа")]
        Path7 = 7,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Инженерные системы
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Инженерные системы")]
        Path8 = 8,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Конструктивные элементы
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Конструктивные элементы")]
        Path9 = 9,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Лифты
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Лифты")]
        Path10 = 10,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Общие сведения
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Общие сведения")]
        Path11 = 11,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\План мер по снижению расходов
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\План мер по снижению расходов")]
        Path12 = 12,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\План работ по содержанию и ремонту
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\План работ по содержанию и ремонту")]
        Path13 = 13,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Приборы учета
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Приборы учета")]
        Path14 = 14,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Сведения о случаях снижения платы
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Сведения о случаях снижения платы")]
        Path15 = 15,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Сведения об использовании мест общего пользования
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Сведения об использовании мест общего пользования")]
        Path16 = 16,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Сведения об использовании нежилых помещений
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Паспорт дома\Сведения об использовании нежилых помещений")]
        Path17 = 17,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах")]
        Path18 = 18,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Коммунальная услуга
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Коммунальная услуга")]
        Path19 = 19,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Административная ответственность
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Административная ответственность")]
        Path20 = 20,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Документы
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Документы")]
        Path21 = 21,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Лицензии
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Лицензии")]
        Path22 = 22,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Для рейтинга управляющих организаций
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Для рейтинга управляющих организаций")]
        Path23 = 23,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Общие сведения
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Общие сведения")]
        Path24 = 24,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Режимы работы\Прием граждан
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Режимы работы\Прием граждан")]
        Path25 = 25,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Режимы работы\Работа диспетчерских служб
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Режимы работы\Работа диспетчерских служб")]
        Path26 = 26,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Режимы работы\Режим работы
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Общие сведения\Режимы работы\Режим работы")]
        Path27 = 27,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Сведения о договорах
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Сведения о договорах")]
        Path28 = 28,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Сведения о расторгнутых договорах
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Сведения о расторгнутых договорах")]
        Path29 = 29,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Сведения о фондах
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Сведения о фондах")]
        Path30 = 30,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Финансовая деятельность\Документы
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Финансовая деятельность\Документы")]
        Path31 = 31,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Финансовая деятельность\Коммунальные услуги\Задолженность УК за коммунальные услуги
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Финансовая деятельность\Коммунальные услуги\Задолженность УК за коммунальные услуги")]
        Path32 = 32,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Финансовая деятельность\Общие сведения
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Финансовая деятельность\Общие сведения")]
        Path33 = 33,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Финансовая деятельность\Управление по домам
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Финансовая деятельность\Управление по домам")]
        Path34 = 34,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Членство в объединениях
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Сведения об УО\Членство в объединениях")]
        Path35 = 35,

        /// <summary>
        /// Участники процесса\Контрагенты\Контрагент\Краткое наименование юр. лица
        /// </summary>
        [Display(@"Участники процесса\Контрагенты\Контрагент\Краткое наименование юр. лица")]
        Path36 = 36,

        /// <summary>
        /// Участники процесса\Роли контрагента\Управляющие организации\Управляющая организация\Управление домами
        /// </summary>
        [Display(@"Участники процесса\Роли контрагента\Управляющие организации\Управляющая организация\Управление домами")]
        Path37 = 37,

        /// <summary>
        /// Участники процесса\Роли контрагента\Управляющие организации\Управляющая организация\Доля участия СФ (%)
        /// </summary>
        [Display(@"Участники процесса\Роли контрагента\Управляющие организации\Управляющая организация\Доля участия СФ (%)")]
        Path38 = 38,

        /// <summary>
        /// Участники процесса\Роли контрагента\Управляющие организации\Управляющая организация\Доля участия МО (%)
        /// </summary>
        [Display(@"Участники процесса\Роли контрагента\Управляющие организации\Управляющая организация\Доля участия МО (%)")]
        Path39 = 39,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об оплатах коммунальных услуг
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об оплатах коммунальных услуг")]
        Path40 = 40,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Услуга капремонта
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Услуга капремонта")]
        Path41 = 41,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Услуга ремонта
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Услуга ремонта")]
        Path42 = 42,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Услуга жилищная
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Услуга жилищная")]
        Path43 = 43,

        /// <summary>
        /// Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Услуга управление МКД
        /// </summary>
        [Display(@"Раскрытие информации\Раскрытие информации по 731 (988) ПП РФ\Объекты в управлении\Сведения об услугах\Услуга управление МКД")]
        Path44 = 44
    }
}