namespace Bars.GisIntegration.Inspection.Enums
{
    using Bars.B4.Utils;

    /// <summary>
    /// Предмет проверки
    /// </summary>
    public enum ExaminationObject
    {
        /// <summary>
        /// Соблюдение обязательных требований к выполнению лицами, осуществляющими управление МКД, услуг и работ по содержанию и ремонту общего имущества в МКД в соответствии с требованиями законодательства РФ
        /// </summary>
        [Display("Соблюдение обязательных требований к выполнению лицами, осуществляющими управление МКД, услуг и работ по содержанию и ремонту общего имущества в МКД в соответствии с требованиями законодательства РФ")]
        Compliance = 10
    }
}

