
Функционал: Доработки к Реестру жилых домов


Структура сценария: отображение новые столбцов реестра
Когда пользователь заходит в раздел "Реестр жилых домов" и выгружает данные в Excel
Тогда в выгруженном файле присутствуют столбцы "<столбец1>"
И значение столбца "<столбец1>" = значение столбца из реестра жилых домов "<столбец2>"

Примеры: 
| столбец1                 | столбец                  |
| Общий строительный объем | Общий строительный объем |
| Год постройки            | Год постройки            |
| Дата первой приватизации | Дата первой приватизации |
